{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d3931e57",
   "metadata": {},
   "source": [
    " Начинающий предприниматель Александр открыл свою первую пиццерию. Для учета заказов он использует максимально простой инструмент – записывает в блокнот информацию о дате заказа, названии пиццы и стоимости заказа (стоимость одной и той же пиццы даже в один и тот же день может быть разной – это зависит от дополнительных ингредиентов, которые пожелал добавить клиент, но которые Александр в своем блокноте никак не учитывает). По прошествии нескольких дней Александр хочет извлечь из своих записей какую-нибудь полезную информацию. Напишите программу, которая будет выводить:\n",
    "а) список всех пицц с указанием, сколько раз их заказывали; список должен быть отсортирован по убыванию количества заказов, то есть первой в списке должна оказаться самая популярная пицца;\n",
    "б) список всех дат с указанием суммарной стоимости проданных в этот день пицц; список должен быть отсортирован хронологически;\n",
    "в) информацию о самом дорогом заказе;\n",
    "г) среднюю стоимость заказа (среднее арифметическое по всем стоимостям).\n",
    "Формат входных и выходных данных определите самостоятельно."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "374993e0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "from collections import defaultdict\n",
    "\n",
    "def analyze_pizzeria_data():\n",
    "    \"\"\"\n",
    "    Программа для анализа данных пиццерии с группировкой по датам\n",
    "    \"\"\"\n",
    "    print(\"=== АНАЛИЗ ДАННЫХ ПИЦЦЕРИИ ===\")\n",
    "    print(\"Введите данные о заказах:\")\n",
    "    print(\"Формат: сначала строка с датой (ДД.ММ.ГГГГ), затем строки с заказами (Пицца Стоимость)\")\n",
    "    print(\"Для завершения ввода введите пустую строку\")\n",
    "    print()\n",
    "    print(\"Пример:\")\n",
    "    print(\"15.03.2024\")\n",
    "    print(\"Маргарита 850\")\n",
    "    print()\n",
    "    \n",
    "    orders = []\n",
    "    current_date = None\n",
    "    \n",
    "    while True:\n",
    "        line = input().strip()\n",
    "        if not line:\n",
    "            break\n",
    "\n",
    "        try:\n",
    "            date_candidate = datetime.strptime(line, \"%d.%m.%Y\").date()\n",
    "            current_date = date_candidate\n",
    "            continue  \n",
    "        except ValueError:\n",
    "            pass\n",
    "            \n",
    "        if current_date is None:\n",
    "            continue\n",
    "            \n",
    "        parts = line.split()\n",
    "        if len(parts) < 2:\n",
    "            continue\n",
    "        \n",
    "        pizza_name = ' '.join(parts[:-1])\n",
    "        cost = float(parts[-1])\n",
    "        \n",
    "        orders.append({\n",
    "            'date': current_date,\n",
    "            'pizza': pizza_name,\n",
    "            'cost': cost\n",
    "        })\n",
    "    \n",
    "    if not orders:\n",
    "        print(\"\\nНет данных для анализа.\")\n",
    "        return\n",
    "    \n",
    "    # Анализ данных\n",
    "    \n",
    "    # а) Статистика по пиццам\n",
    "    pizza_stats = defaultdict(int)\n",
    "    for order in orders:\n",
    "        pizza_stats[order['pizza']] += 1\n",
    "    \n",
    "    # Сортируем по убыванию количества заказов\n",
    "    sorted_pizzas = sorted(pizza_stats.items(), key=lambda x: x[1], reverse=True)\n",
    "    \n",
    "    # б) Статистика по датам\n",
    "    date_stats = defaultdict(float)\n",
    "    for order in orders:\n",
    "        date_stats[order['date']] += order['cost']\n",
    "    \n",
    "    # Сортируем даты хронологически\n",
    "    sorted_dates = sorted(date_stats.items(), key=lambda x: x[0])\n",
    "    \n",
    "    # в) Самый дорогой заказ\n",
    "    most_expensive = max(orders, key=lambda x: x['cost'])\n",
    "    \n",
    "    # г) Средняя стоимость заказа\n",
    "    average_cost = sum(order['cost'] for order in orders) / len(orders)\n",
    "    \n",
    "    # Вывод результатов\n",
    "    \n",
    "    print(\"\\n\" + \"=\"*50)\n",
    "    print(\"РЕЗУЛЬТАТЫ АНАЛИЗА:\")\n",
    "    print(\"=\"*50)\n",
    "    \n",
    "    # а) Вывод статистики по пиццам\n",
    "    print(\"\\nа) СТАТИСТИКА ПО ПИЦЦАМ (отсортировано по популярности):\")\n",
    "    print(\"-\" * 40)\n",
    "    for pizza, count in sorted_pizzas:\n",
    "        print(f\"{pizza}: {count} заказ(ов)\")\n",
    "    \n",
    "    # б) Вывод статистики по датам\n",
    "    print(\"\\nб) СТАТИСТИКА ПО ДАТАМ (отсортировано хронологически):\")\n",
    "    print(\"-\" * 40)\n",
    "    for date, total in sorted_dates:\n",
    "        date_str = date.strftime(\"%d.%m.%Y\")\n",
    "        print(f\"{date_str}: {total:.2f} руб.\")\n",
    "    \n",
    "    # в) Вывод информации о самом дорогом заказе\n",
    "    print(\"\\nв) САМЫЙ ДОРОГОЙ ЗАКАЗ:\")\n",
    "    print(\"-\" * 40)\n",
    "    date_str = most_expensive['date'].strftime(\"%d.%m.%Y\")\n",
    "    print(f\"Дата: {date_str}\")\n",
    "    print(f\"Пицца: {most_expensive['pizza']}\")\n",
    "    print(f\"Стоимость: {most_expensive['cost']:.2f} руб.\")\n",
    "    \n",
    "    # г) Вывод средней стоимости\n",
    "    print(\"\\nг) СРЕДНЯЯ СТОИМОСТЬ ЗАКАЗА:\")\n",
    "    print(\"-\" * 40)\n",
    "    print(f\"{average_cost:.2f} руб.\")\n",
    "\n",
    "analyze_pizzeria_data()"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
